# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexFormat..::..Dispose Method
VertexFormat Class See Also
---
Releases all resources used by the VertexFormat
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace